app/views/comments/create.turbo_stream.erb

<%= turbo_stream.update "post#{@post.id}-comments-count" do %>
  <%= pluralize(@post.comments.count, "comment") %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]