app/helpers/posts_helper.rb

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."likeable_id" = ? LIMIT ?  [["user_id", 8], ["likeable_id", 1], ["LIMIT", 1]]
---
  def has_likes_on?(likeable)
    current_user.likes.find_by(likeable_id: likeable.id)