app/helpers/posts_helper.rb

  def has_likes_on?(likeable)
    if user_signed_in?
      type = likeable.is_a?(Post) ? "Post" : "Comment"
      current_user.likes.find_by(likeable_type: type,likeable_id: likeable.id)
    else
      type = likeable.is_a?(Post) ? "Post" : "Comment"
      Like.find_by(likeable_type: type,likeable_id: likeable.id)
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."likeable_type" = ? AND "likes"."likeable_id" = ? LIMIT ?  [["user_id", 8], ["likeable_type", "Comment"], ["likeable_id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."likeable_type" = ? AND "likes"."likeable_id" = ? LIMIT ?  [["likeable_type", "Post"], ["likeable_id", 1], ["LIMIT", 1]]