app/views/posts/_post.html.erb

    <% end %>
    <div class="post-actions-comments" id="post-comments-count"><%= pluralize(post.comments.count, "comment") %></div>
---
SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]