app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    comment = Comment.new(comment_params)
    comment.post = @post
    comment.user = current_user

    if comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "keep it doing!"], ["user_id", 1], ["post_id", 1], ["created_at", "2022-09-02 09:05:30.288377"], ["updated_at", "2022-09-02 09:05:30.288377"]]