app/controllers/likes_controller.rb

  def create
    if params[:likeable_type] == 'Post'
      @likeable =  Post.find(params[:post_id])
    elsif params[:likeable_type] == 'Comment'
      @likeable = Comment.find(params[:comment_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    if params[:likeable_type] == 'Post'
      @likeable =  current_user.posts.find_by(id: params[:post_id])
      current_user.likes.where(likeable_type: 'Post', likeable_id: @likeable.id ).delete_all
    elsif params[:likeable_type] == 'Comment'
      @likeable = current_user.comments.find_by(id: params[:comment_id])
      current_user.likes.where(likeable_type: 'Comment', likeable_id: @likeable.id).delete_all
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."user_id" = ? AND "likes"."likeable_type" = ? AND "likes"."likeable_id" = ?  [["user_id", 4], ["user_id", 4], ["likeable_type", "Post"], ["likeable_id", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."likeable_type" = ? AND "likes"."likeable_id" = ? LIMIT ?  [["user_id", 4], ["likeable_type", "Post"], ["likeable_id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ? AND "comments"."id" = ? LIMIT ?  [["user_id", 4], ["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."likeable_type" = ? AND "likes"."likeable_id" = ?  [["user_id", 4], ["likeable_type", "Comment"], ["likeable_id", 1]]