app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 11], ["body", "Eu, que juapo son"], ["created_at", "2022-09-20 07:39:25.035020"], ["updated_at", "2022-09-20 07:39:25.035020"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    if @post.valid?
      @post.save

UPDATE "posts" SET "updated_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2022-09-20 07:39:25.039288"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    respond_to do |format|
      if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]
---
  def destroy
    @post = Post.find(params[:id])
    @post.image.purge
    @post.destroy