app/models/user.rb

INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id") VALUES (?, ?, ?)  [["user_id", 4], ["likeable_type", "Post"], ["likeable_id", 1]]
---
  def like!(obj)
    type = obj.is_a?(Post) ? "Post" : "Comment"
    likes << Like.new(user_id: obj.user_id, likeable_type: type, likeable_id: obj.id)